Repository: koenemans/neighborhood-community-application
Catalog: templates/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Neighborhood Community
nl: Buurtgemeenschap

source: News
nl: Nieuws

source: Activities
nl: Activiteiten

source: Committees
nl: Commissies

source: Neighborhood Community. All rights reserved.
nl: Buurtgemeenschap. Alle rechten voorbehouden.

source: Welcome to the Neighborhood Community Application!
nl: Welkom bij de Buurtgemeenschap Applicatie!

source: This is a platform where you can find information about local news, activities, and committees.
nl: Dit is een platform waar je informatie kunt vinden over lokaal nieuws, activiteiten en commissies.

source: Check out the latest news
nl: Zie het laatste nieuws

source: or
nl: of

source: explore upcoming activities
nl: ontdek aankomende activiteiten

source: If you're interested in getting involved
nl: Als je ge√Ønteresseerd bent om betrokken te raken

source: learn more about our committees
nl: leer meer over onze commissies
